2412/tutorials/multiphase/overInterDyMFoam/floatingBodyWithSpring/background/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    stationaryWalls
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }

    "(atmosphere|sidePatch)"
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }

    floatingObject
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }

    overset
    {
        type            overset;
    }

    oversetPatch
    {
        type            overset;
    }
}


// ************************************************************************* //
